//UPDCLIC JOB (ACCT),'COMPILE',CLASS=A,MSGCLASS=X,
//         NOTIFY=&SYSUID
//*
//COBRUN EXEC IGYWCL
//COBOL.SYSIN DD DSN=&SYSUID..CBL(UPDCLI),DISP=SHR
//LKED.SYSLMOD DD DSN=&SYSUID..LOAD(UPDCLI),DISP=SHR
