       01 PRODUCT-RECORD.
          05 PRODUCT-ID        PIC 9(6).
          05 FILLER            PIC X VALUE SPACE.
          05 PRODUCT-NAME      PIC X(30).
          05 FILLER            PIC X VALUE SPACE.
          05 PRODUCT-PRICE     PIC 9(6)V99.
          05 FILLER            PIC X VALUE SPACE.
          05 PRODUCT-STOCK     PIC 9(5).
          05 FILLER            PIC X VALUE SPACE.
          05 PRODUCT-DATE      PIC X(10).