IDENTIFICATION DIVISION.
PROGRAM-ID. CLI-UPDATE.

DATA DIVISION.
WORKING-STORAGE SECTION.
EXEC SQL INCLUDE SQLCA END-EXEC.

01 WS-ID PIC 9(6).
01 WS-NOM PIC X(50).

PROCEDURE DIVISION.

DISPLAY "ID : "
ACCEPT WS-ID

DISPLAY "NEW NAME : "
ACCEPT WS-NOM

EXEC SQL
   UPDATE clients
   SET nom = :WS-NOM
   WHERE id = :WS-ID
END-EXEC

DISPLAY "UPDATED"

STOP RUN.