IDENTIFICATION DIVISION.
PROGRAM-ID. CLI-DELETE.

DATA DIVISION.
WORKING-STORAGE SECTION.
EXEC SQL INCLUDE SQLCA END-EXEC.

01 WS-ID PIC 9(6).

PROCEDURE DIVISION.

DISPLAY "ID : "
ACCEPT WS-ID

EXEC SQL
   DELETE FROM clients
   WHERE id = :WS-ID
END-EXEC

DISPLAY "DELETED"

STOP RUN.