       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCUL.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-NOMBRE1      PIC 9(3) VALUE 10.
       01 WS-NOMBRE2      PIC 9(3) VALUE 20.
       01 WS-SOMME        PIC 9(4).
       01 WS-MESSAGE      PIC X(20) VALUE "LA SOMME EST : ".
       
       PROCEDURE DIVISION.
           COMPUTE WS-SOMME = WS-NOMBRE1 + WS-NOMBRE2.
           DISPLAY WS-MESSAGE WS-SOMME.
           STOP RUN.
