//Z74830C  JOB (ACCT),'DB2 SELECT',CLASS=A,MSGCLASS=X,
//             NOTIFY=&SYSUID,REGION=0M
//STEP1   EXEC PGM=IKJEFT01
//STEPLIB DD DSN=DSN510.SDSNLOAD,DISP=SHR
//        DD DSN=Z74830.HELLOBNK.LOAD,DISP=SHR
//SYSTSPRT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSTSIN  DD *
  DSN SYSTEM(DB2PROD)
  RUN PROGRAM(DB2SEL) PLAN(DB2PLAN)
  END
/*
