//Z74830C  JOB (ACCT),'HELLO COBOL',CLASS=A,MSGCLASS=X,
//             NOTIFY=&SYSUID,REGION=0M
//STEPCOMP EXEC IGYWCL,
//             PARM.COBOL='LIB,APOST,NOSEQ'
//COBOL.SYSIN   DD DSN=Z74830.HELLOBNK.COBOL(HELLOBNK),DISP=SHR
//LKED.SYSLMOD  DD DSN=Z74830.HELLOBNK.LOAD(HELLOBNK),DISP=SHR
//STEPGO   EXEC PGM=HELLOBNK
//STEPLIB  DD DSN=Z74830.HELLOBNK.LOAD,DISP=SHR
//SYSOUT   DD SYSOUT=*
