//BATCHJ JOB (ACCT),'RUN BATCH',CLASS=A,MSGCLASS=X,
//         NOTIFY=&SYSUID
//*
//STEP1 EXEC PGM=BATCHCLI
//STEPLIB DD DSN=&SYSUID..LOAD,DISP=SHR
//CLIENTS DD DSN=&SYSUID..CLIENTS,DISP=SHR
//OUTFILE DD DSN=&SYSUID..CLIENTS.NEW,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(TRK,(1,1)),
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)
//SYSOUT DD SYSOUT=*
//CEEDUMP DD DUMMY
