//BATCLIC JOB (ACCT),'COMPILE',CLASS=A,MSGCLASS=X,
//         NOTIFY=&SYSUID
//*
//COBRUN EXEC IGYWCL
//COBOL.SYSIN DD DSN=&SYSUID..CBL(BATCHCLI),DISP=SHR
//LKED.SYSLMOD DD DSN=&SYSUID..LOAD(BATCHCLI),DISP=SHR
