       IDENTIFICATION DIVISION.
       PROGRAM-ID. RAPPORT_CA.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-COMMANDE   PIC X(100).
       
       PROCEDURE DIVISION.
       DEBUT.
           MOVE "./rapport_ca.sh" TO WS-COMMANDE
           CALL "SYSTEM" USING WS-COMMANDE
           STOP RUN.
