IDENTIFICATION DIVISION.
PROGRAM-ID. SIN-DECLARE.

DATA DIVISION.
WORKING-STORAGE SECTION.
EXEC SQL INCLUDE SQLCA END-EXEC.

01 WS-ID          PIC 9(8).
01 WS-CONTRAT     PIC 9(8).
01 WS-MONTANT     PIC 9(8)V99.
01 WS-STATUT      PIC X(20) VALUE "OPEN".

PROCEDURE DIVISION.

DISPLAY "ID SINISTRE : "
ACCEPT WS-ID

DISPLAY "CONTRAT : "
ACCEPT WS-CONTRAT

DISPLAY "MONTANT : "
ACCEPT WS-MONTANT

EXEC SQL
   INSERT INTO sinistres
   VALUES(:WS-ID,:WS-CONTRAT,CURRENT_DATE,:WS-MONTANT,:WS-STATUT)
END-EXEC

DISPLAY "SINISTRE ENREGISTRE"

STOP RUN.