//WRITEJR JOB (ACCT),'RUN',CLASS=A,MSGCLASS=X,
//         NOTIFY=&SYSUID
//*
//STEP1 EXEC PGM=WRITECLI
//STEPLIB DD DSN=&SYSUID..LOAD,DISP=SHR
//CLIENTS DD DSN=&SYSUID..CLIENTS,DISP=SHR
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
006
MAEL
09000
/*
//CEEDUMP DD DUMMY
