//TP10R JOB (ACCT),'RUN REPORT',CLASS=A,MSGCLASS=X,
//         NOTIFY=&SYSUID
//*
//STEP1 EXEC PGM=RPTCLI
//STEPLIB DD DSN=&SYSUID..LOAD,DISP=SHR
//CLIENTS DD DSN=&SYSUID..CLIENTS,DISP=SHR
//SYSOUT DD SYSOUT=*
//CEEDUMP DD DUMMY
