//TP10C JOB (ACCT),'TP10 COMPILE',CLASS=A,MSGCLASS=X,
//         NOTIFY=&SYSUID
//*
//COBRUN EXEC IGYWCL
//COBOL.SYSIN DD DSN=&SYSUID..CBL(RPTCLI),DISP=SHR
//LKED.SYSLMOD DD DSN=&SYSUID..LOAD(RPTCLI),DISP=SHR
