//BANKJOB JOB CLASS=A,MSGCLASS=A
//STEP1   EXEC PGM=BANKTRX
//TRANS   DD DSN=Z74830.FACT.CLITRAN,DISP=SHR
//REPORT  DD DSN=Z74830.COBOL.REPORT,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(TRK,(1,1))
//SYSOUT  DD SYSOUT=*

//* //BANKJOB JOB CLASS=A,MSGCLASS=A
//* //STEP1   EXEC PGM=BANKTRX
//* //TRANS   DD DSN=Z74830.COBOL.TRANS,DISP=SHR
//* //REPORT  DD DSN=Z74830.COBOL.REPORT,DISP=(NEW,CATLG,DELETE)
//* //SYSOUT  DD SYSOUT=*