       IDENTIFICATION DIVISION.
       PROGRAM-ID. SALAIRE.

       DATA DIVISION.
       WORKING-STORAGE SECTION.


       01 WS-MENSUEL     PIC 9(6)V99.
       01 WS-ANNUEL      PIC 9(8)V99.

       PROCEDURE DIVISION.

           DISPLAY "SALAIRE : "
           ACCEPT WS-MENSUEL

           MULTIPLY 12 BY WS-MENSUEL GIVING WS-ANNUEL

           DISPLAY "ANNUEL : " WS-ANNUEL

           STOP RUN.