       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAIN.

       PROCEDURE DIVISION.
           DISPLAY "===========================".
           DISPLAY " INVENTORY SYSTEM ".
           DISPLAY "===========================".
           CALL 'MENU'.
           STOP RUN.