//HELLOJOB JOB (ACCT),'TEST JCL',
//             CLASS=A,
//             MSGCLASS=X,
//             NOTIFY=&SYSUID
//*
//STEP01   EXEC PGM=IEFBR14
//*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//
