IDENTIFICATION DIVISION.
PROGRAM-ID. REP-CONTRACTS.

ENVIRONMENT DIVISION.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 WS-MESSAGE PIC X(50).

PROCEDURE DIVISION.

    MOVE "REP-CONTRACTS EXECUTION" TO WS-MESSAGE
    DISPLAY WS-MESSAGE

    STOP RUN.
