IDENTIFICATION DIVISION.
PROGRAM-ID. BAT-PAYMENT.

ENVIRONMENT DIVISION.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 WS-MESSAGE PIC X(50).

PROCEDURE DIVISION.

    MOVE "BAT-PAYMENT EXECUTION" TO WS-MESSAGE
    DISPLAY WS-MESSAGE

    STOP RUN.
