       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOBNK.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-MESSAGE PIC X(30) VALUE 'HELLO WORLD - BATCH COBOL'.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY WS-MESSAGE
           DISPLAY 'FIN DU PROGRAMME'
           GOBACK.
