//SORTNOM JOB (001),'TRI NOMS'

//STEP1   EXEC PGM=SORT

//SORTIN  DD DSN=USER.NOM.IN,DISP=SHR

//SORTOUT DD DSN=USER.NOM.OUT,
//           DISP=(NEW,CATLG,DELETE),
//           SPACE=(TRK,(1,1)),
//           DCB=(RECFM=FB,LRECL=80)

//SYSOUT  DD SYSOUT=*

//SYSIN   DD *
  SORT FIELDS=(1,10,CH,A)
/*