01 PRODUCT-REC.
   05 PRODUCT-ID       PIC 9(6).
   05 PRODUCT-CODE     PIC X(20).
   05 PRODUCT-NAME     PIC X(100).
   05 PRODUCT-PRICE-B  PIC 9(6)V99.
   05 PRODUCT-PRICE-S  PIC 9(6)V99.
   05 PRODUCT-STOCK    PIC 9(5).
   05 PRODUCT-MIN      PIC 9(5).
   05 PRODUCT-CAT      PIC 9(5).
   05 PRODUCT-SUPPLIER PIC 9(5).
   05 PRODUCT-DATE     PIC X(19).