       01 USER-RECORD.
           05 USER-ID        PIC 9(6).
           05 USER-LOGIN     PIC X(30).
           05 USER-PASSWORD  PIC X(255).
           05 USER-ROLE      PIC X(20).
           05 USER-NAME      PIC X(100).
           05 USER-ACTIVE    PIC 9(1).