//HELLO1J JOB CLASS=A,MSGCLASS=A,NOTIFY=&SYSUID
//*----------------------------------------------*
//* COMPILATION + LINK + EXECUTION
//*----------------------------------------------*
//COBRUN EXEC IGYWCL
//COBOL.SYSIN DD DSN=&SYSUID..CBL(HELLO1),DISP=SHR
//LKED.SYSLMOD DD DSN=&SYSUID..LOAD(HELLO1),DISP=SHR
//*
// IF RC = 0 THEN
//RUN EXEC PGM=HELLO1
//STEPLIB DD DSN=&SYSUID..LOAD,DISP=SHR
//SYSOUT DD SYSOUT=*
//CEEDUMP DD DUMMY
//SYSUDUMP DD DUMMY
// ENDIF
