       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO1.

       PROCEDURE DIVISION.
           DISPLAY "********************************".
           DISPLAY "*      BIENVENUE SUR IBM Z      *".
           DISPLAY "*        HELLO WORLD !          *".
           DISPLAY "********************************".
           STOP RUN.
