//SORTCLI JOB (ACCT),'SORT CLIENTS',CLASS=A,MSGCLASS=X,
//         NOTIFY=&SYSUID
//*
//STEP1 EXEC PGM=SORT
//SYSOUT   DD SYSOUT=*
//SORTIN   DD DSN=&SYSUID..CLIENTS,DISP=SHR
//SORTOUT  DD DSN=&SYSUID..CLIENTS.SORT2,
//             DISP=(NEW,CATLG,DELETE),
//             SPACE=(TRK,(1,1)),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)
//SYSIN DD *
  SORT FIELDS=(1,3,CH,A)
/*
