//ALLOCC   JOB (ACCT),'ALLOCATE DATASETS',CLASS=A,MSGCLASS=X
//STEP1    EXEC PGM=IEFBR14
//COBOL    DD DSN=Z74830.HELLOBNK.COBOL,
//         DISP=(NEW,CATLG),
//         UNIT=SYSDA,
//         SPACE=(TRK,(1,1,1)),
//         DCB=(RECFM=FB,LRECL=80,BLKSIZE=8000)
//LOAD     DD DSN=Z74830.HELLOBNK.LOAD,
//         DISP=(NEW,CATLG),
//         UNIT=SYSDA,
//         SPACE=(TRK,(1,1,1)),
//         DCB=(RECFM=U,LRECL=0,BLKSIZE=32760),
//         DSNTYPE=LIBRARY
