//Z74830C  JOB (ACCT),'COMPILE SEQPROC',CLASS=A,MSGCLASS=X,
//             NOTIFY=&SYSUID,REGION=0M
//STEPCOMP EXEC IGYWCL,
//             PARM.COBOL='LIB,APOST,NOSEQ'
//COBOL.SYSIN   DD DSN=Z74830.HELLOBNK.COBOL(SEQPROC),DISP=SHR
//LKED.SYSLMOD  DD DSN=Z74830.HELLOBNK.LOAD(SEQPROC),DISP=SHR