//CREINP   JOB (ACCT),'CREATE INPUT',CLASS=A,MSGCLASS=X
//STEP1    EXEC PGM=IEBGENER
//SYSUT1   DD *
LIGNE 1 DU FICHIER D ENTREE
LIGNE 2 DU FICHIER D ENTREE
LIGNE 3 DU FICHIER D ENTREE
/*
//SYSUT2   DD DSN=Z74830.INPUT.SEQ,
//         DISP=(NEW,CATLG,DELETE),
//         SPACE=(TRK,(1,1)),
//         DCB=(RECFM=FB,LRECL=80,BLKSIZE=8000)
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DUMMY
