//Z74830C  JOB (ACCT),'SEQUENTIAL FILE',CLASS=A,MSGCLASS=X,
//             NOTIFY=&SYSUID,REGION=0M
//STEP1   EXEC PGM=SEQPROC
//STEPLIB DD DSN=Z74830.HELLOBNK.LOAD,DISP=SHR
//INFILE  DD DSN=Z74830.INPUT.SEQ,DISP=SHR
//OUTFILE DD DSN=Z74830.OUTPUT.SEQ,
//         DISP=(NEW,CATLG,DELETE),
//         SPACE=(TRK,(5,5)),
//         DCB=(RECFM=FB,LRECL=80,BLKSIZE=8000)
//SYSOUT  DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
