//Z74830C  JOB (ACCT),'VSAM TEST',CLASS=A,MSGCLASS=X,
//             NOTIFY=&SYSUID,REGION=0M
//STEP1   EXEC PGM=VSAMPROC
//STEPLIB DD DSN=Z74830.HELLOBNK.LOAD,DISP=SHR
//VSAM    DD DSN=Z74830.VSAM.KSDS,DISP=OLD
//SYSOUT  DD SYSOUT=*
