IDENTIFICATION DIVISION.
PROGRAM-ID. PAY-COLLECT.

ENVIRONMENT DIVISION.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 WS-MESSAGE PIC X(50).

PROCEDURE DIVISION.

    MOVE "PAY-COLLECT EXECUTION" TO WS-MESSAGE
    DISPLAY WS-MESSAGE

    STOP RUN.
