       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.

       ENVIRONMENT DIVISION.

       DATA DIVISION.

       WORKING-STORAGE SECTION.
       01 MSG PIC X(30) VALUE "HELLO FROM COBOL + JCL".

       PROCEDURE DIVISION.
           DISPLAY MSG
           STOP RUN.
