//HELLO   JOB (FB3),'TEST JOB',
//         CLASS=A,MSGCLASS=X
//STEP1    EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DUMMY
//SYSUT1   DD *
Hello World from IBM Z!
/*
//SYSUT2   DD SYSOUT=*