//HELLO JOB (ACCT),'COBOL TEST',
// CLASS=A,MSGCLASS=X,NOTIFY=&SYSUID
//*
//STEP1  EXEC IGYWCL
//COBOL.SYSIN DD *
       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.

       PROCEDURE DIVISION.
           DISPLAY 'HELLO FROM COBOL ON MAINFRAME'.
           STOP RUN.
/*
//*
//STEP2 EXEC PGM=HELLO
//STEPLIB DD DSN=Z74830.LOAD,DISP=SHR
//SYSPRINT DD SYSOUT=*