       01  ADHERENT-STRUCT.
           05  ADH-ID             PIC X(6).
           05  ADH-NOM            PIC X(15).
           05  ADH-PRENOM         PIC X(10).
           05  ADH-ADRESSE        PIC X(35).
           05  ADH-DATE-ADHESION  PIC X(10).
