       01  EMPRUNT-STRUCT.
           05  EMP-ID             PIC X(6).
           05  EMP-ID-ADHERENT    PIC X(6).
           05  EMP-ISBN           PIC X(17).
           05  EMP-DATE-EMPRUNT   PIC X(10).
           05  EMP-DATE-RETOUR    PIC X(10).
