       01  LIVRE-STRUCT.
           05  LIV-ISBN           PIC X(17).
           05  LIV-TITRE          PIC X(30).
           05  LIV-AUTEUR         PIC X(20).
           05  LIV-CATEGORIE      PIC X(15).
           05  LIV-QUANTITE       PIC 9(3).
