01 PAYMENT-REC.
   05 PAYMENT-ID        PIC 9(8).
   05 CONTRACT-ID       PIC 9(8).
   05 PAYMENT-DATE      PIC X(10).
   05 PAYMENT-AMOUNT    PIC 9(8)V99.
