//RHJOB1  JOB (001),'RH TEST',
//         CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID
//*
//STEP1    EXEC IGYWCLG
//COBOL.SYSIN DD DSN=Z75013.CBL(RH001),DISP=SHR
//*
//GO.SYSOUT DD SYSOUT=*