       IDENTIFICATION DIVISION.
       PROGRAM-ID. SORTCLI.

       DATA DIVISION.

       WORKING-STORAGE SECTION.

       01 WS-MESSAGE PIC X(20).


       PROCEDURE DIVISION.

       MAIN-PARA.

           MOVE 'TP13 OK'
           TO WS-MESSAGE.

           DISPLAY WS-MESSAGE.

           STOP RUN.