IDENTIFICATION DIVISION.
PROGRAM-ID. CONSULTER-SOLDE.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 WS-CARTE PIC X(16).
01 WS-CMD   PIC X(500).

PROCEDURE DIVISION.

MAIN.

    DISPLAY "=== CONSULTATION SOLDE ==="

    DISPLAY "CARTE : "
    ACCEPT WS-CARTE

    STRING
        "sqlite3 -header -column data/input/atm.db "
        """SELECT NUM_CARTE, SOLDE, STATUT FROM COMPTES WHERE NUM_CARTE='"
        FUNCTION TRIM(WS-CARTE)
        "';"""
        INTO WS-CMD
    END-STRING

    CALL "SYSTEM" USING WS-CMD

    GOBACK.