IDENTIFICATION DIVISION.
PROGRAM-ID. MINI-RELEVE.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 WS-CARTE PIC X(16).
01 WS-CMD   PIC X(1000).

PROCEDURE DIVISION.

    DISPLAY "MINI RELEVE"

    DISPLAY "CARTE : "
    ACCEPT WS-CARTE

    STRING
      "sqlite3 data/input/atm.db "
      "'SELECT DATE_OPERATION || "" | "" || "
      "TYPE_OPERATION || "" | "" || MONTANT "
      "FROM TRANSACTIONS "
      "WHERE NUMERO_CARTE='''"
      FUNCTION TRIM(WS-CARTE)
      "''' "
      "ORDER BY ID_TRANSACTION DESC "
      "LIMIT 10;'"
      INTO WS-CMD
    END-STRING

    CALL "SYSTEM" USING WS-CMD

    STOP RUN.