       IDENTIFICATION DIVISION.
       PROGRAM-ID. BONJOUR.

       PROCEDURE DIVISION.

           DISPLAY "J'APPRENDS JCL".
           DISPLAY "J'APPRENDS COBOL".
           DISPLAY "JE SERAI DEVELOPPEUR MAINFRAME".

           STOP RUN.