//LOADCLI  JOB (Z75013),'LOAD CLIENTS',CLASS=A,MSGCLASS=X
//STEP1    EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DUMMY
//SYSUT1   DD *
0000000001DUPONT      JEAN          00000100000
0000000002MARTIN     MARIE         00000250000
0000000003DURAND     PIERRE        00000075000
/*
//SYSUT2   DD DSN=Z75013.BANK.CLIENTS.FILE,DISP=OLD
