//MERGEJ JOB (ACCT),'RUN',CLASS=A,MSGCLASS=X,
//         NOTIFY=&SYSUID
//*
//STEP1 EXEC PGM=MERGECLI
//STEPLIB DD DSN=&SYSUID..LOAD,DISP=SHR
//CLIENTS1 DD DSN=&SYSUID..CLIENTS1,DISP=SHR
//CLIENTS2 DD DSN=&SYSUID..CLIENTS2,DISP=SHR
//CLNTSALL DD DSN=&SYSUID..CLIENTS.ALL,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(TRK,(1,1)),
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)
//SYSOUT DD SYSOUT=*
//CEEDUMP DD DUMMY
