//MERGEC JOB (ACCT),'COMPILE',CLASS=A,MSGCLASS=X,
//         NOTIFY=&SYSUID
//*
//COBRUN EXEC IGYWCL
//COBOL.SYSIN DD DSN=&SYSUID..CBL(MERGECLI),DISP=SHR
//LKED.SYSLMOD DD DSN=&SYSUID..LOAD(MERGECLI),DISP=SHR
