//TRI13JOB JOB (TP13),'TRI BUBBLE SORT',CLASS=A,MSGCLASS=A,
//         NOTIFY=&SYSUID
//*--------------------------------------------------------
//* TP13 - COMPILATION + EXECUTION DU TRI BUBBLE SORT
//* PENSER A ADAPTER LE HLQ (HERC01) SI DIFFERENT
//*--------------------------------------------------------
//STEP1    EXEC IGYWCLG
//COBOL.SYSIN DD DSN=Z74830.COBOL.SOURCE(TRI13),DISP=SHR
//GO.CLIENTS  DD DSN=Z74830.COBOL.DATA(CLIENTS),DISP=SHR
//GO.SYSOUT   DD SYSOUT=*
