       01  WS-COMMUN.
           05  WS-DATE.
               10  WS-JOUR          PIC 9(2).
               10  WS-MOIS          PIC 9(2).
               10  WS-ANNEE         PIC 9(4).
           05  WS-USER.
               10  WS-USER-NOM      PIC X(30).
               10  WS-USER-TEL      PIC X(15).