//MERGEJOB JOB (001),'MERGE CLIENTS'

//STEP1    EXEC PGM=SORT

//SORTIN01 DD DSN=USER.CLIENTA.IN,DISP=SHR

//SORTIN02 DD DSN=USER.CLIENTB.IN,DISP=SHR

//SORTOUT  DD DSN=USER.CLIENTS.OUT,
//             DISP=(NEW,CATLG,DELETE),
//             SPACE=(TRK,(1,1)),
//             DCB=(RECFM=FB,LRECL=80)

//SYSOUT   DD SYSOUT=*

//SYSIN    DD *
  MERGE FIELDS=(1,10,CH,A)
/*