IDENTIFICATION DIVISION.
PROGRAM-ID. RETRAIT.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 WS-CARTE      PIC X(16).
01 WS-MONTANT    PIC 9(8)V99.
01 WS-MONTANT-T  PIC 9(10)V99.
01 WS-CMD        PIC X(1000).

PROCEDURE DIVISION.

MAIN.

    DISPLAY "=== RETRAIT ATM PRO ==="

    DISPLAY "CARTE : "
    ACCEPT WS-CARTE

    DISPLAY "MONTANT : "
    ACCEPT WS-MONTANT

    MOVE WS-MONTANT TO WS-MONTANT-T

    STRING
        "sqlite3 data/input/atm.db "
        """UPDATE COMPTES SET SOLDE = SOLDE - "
        FUNCTION TRIM(WS-MONTANT-T)
        " WHERE NUM_CARTE='"
        FUNCTION TRIM(WS-CARTE)
        "' AND SOLDE >= "
        FUNCTION TRIM(WS-MONTANT-T)
        ";"""
        INTO WS-CMD
    END-STRING

    CALL "SYSTEM" USING WS-CMD

    DISPLAY "RETRAIT TRAITE"

    GOBACK.