IDENTIFICATION DIVISION.
PROGRAM-ID. TRANSFERT.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 WS-SRC      PIC X(16).
01 WS-DST      PIC X(16).
01 WS-MONTANT  PIC 9(8)V99.
01 WS-CMD      PIC X(1200).

PROCEDURE DIVISION.

MAIN.

    DISPLAY "=== TRANSFERT ATM PRO ==="

    DISPLAY "CARTE SOURCE : "
    ACCEPT WS-SRC

    DISPLAY "CARTE DESTINATION : "
    ACCEPT WS-DST

    DISPLAY "MONTANT : "
    ACCEPT WS-MONTANT

    STRING
        "sqlite3 data/input/atm.db "
        """UPDATE COMPTES SET SOLDE = SOLDE - "
        FUNCTION TRIM(WS-MONTANT)
        " WHERE NUM_CARTE='"
        FUNCTION TRIM(WS-SRC)
        "' AND SOLDE >= "
        FUNCTION TRIM(WS-MONTANT)
        "; """
        INTO WS-CMD
    END-STRING

    CALL "SYSTEM" USING WS-CMD

    STRING
        "sqlite3 data/input/atm.db "
        """UPDATE COMPTES SET SOLDE = SOLDE + "
        FUNCTION TRIM(WS-MONTANT)
        " WHERE NUM_CARTE='"
        FUNCTION TRIM(WS-DST)
        "';"""
        INTO WS-CMD
    END-STRING

    CALL "SYSTEM" USING WS-CMD

    DISPLAY "TRANSFERT OK"

    GOBACK.