//READCLIC JOB (ACCT),'COMPILE',CLASS=A,MSGCLASS=X,
//         NOTIFY=&SYSUID
//*
//COBRUN EXEC IGYWCL
//COBOL.SYSIN  DD DSN=&SYSUID..CBL(READCLI),DISP=SHR
//LKED.SYSLMOD DD DSN=&SYSUID..LOAD(READCLI),DISP=SHR
