//WRTCLIC JOB (ACCT),'COMPILE',CLASS=A,MSGCLASS=X,
//         NOTIFY=&SYSUID
//*
//COBRUN EXEC IGYWCL
//COBOL.SYSIN  DD DSN=&SYSUID..CBL(WRITECLI),DISP=SHR
//LKED.SYSLMOD DD DSN=&SYSUID..LOAD(WRITECLI),DISP=SHR
