//CREATE    JOB (Z75013),'CREATE SOURCE PDS',CLASS=A,MSGCLASS=X
//CREATEP  EXEC PGM=IEFBR14
//DD1      DD DSN=Z75013.COBOL.SRC,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,
//            SPACE=(TRK,(1,1,10)),
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=6160),
//            DSORG=PO
