//DELCLIC JOB (ACCT),'COMPILE',CLASS=A,MSGCLASS=X,
//         NOTIFY=&SYSUID
//*
//COBRUN EXEC IGYWCL
//COBOL.SYSIN DD DSN=&SYSUID..CBL(DELCLI),DISP=SHR
//LKED.SYSLMOD DD DSN=&SYSUID..LOAD(DELCLI),DISP=SHR
