//DELCLIJ JOB (ACCT),'RUN',CLASS=A,MSGCLASS=X,
//         NOTIFY=&SYSUID
//*
//STEP1 EXEC PGM=DELCLI
//STEPLIB DD DSN=&SYSUID..LOAD,DISP=SHR
//CLIENTS DD DSN=&SYSUID..CLIENTS,DISP=SHR
//OUTFILE DD DSN=&SYSUID..CLIENTS.NEW,DISP=SHR
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD DUMMY
